Revit 2024 API
BuiltInFailures.DesignOptionFailures.ConfusingHostByElementsInDesignOptionWarn Property
 An insert in the main model cannot be hosted by an element in a Design Option [--if you continue it will not be added to the design option set].
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ConfusingHostByElementsInDesignOptionWarn { get; }
Visual Basic
Public Shared ReadOnly Property ConfusingHostByElementsInDesignOptionWarn As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ConfusingHostByElementsInDesignOptionWarn {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.DesignOptionFailures Class
Autodesk.Revit.DB Namespace